app/Models/dashboard_model.php

    public function getLoggedUserData($id){

        $builder = $this->db->table('users');
        $builder->where('email',$id);
        $result = $builder->get();
---
SELECT *
FROM `users`
WHERE `email` = 'ksajaykumar73@gmail.com'

    public function getLoggedUserData2($id){

        $builder = $this->db->table('student');
        $builder->where('email1',$id);
        $result = $builder->get();
---
SELECT *
FROM `student`
WHERE `email1` = 'ksajaykumar73@gmail.com'

    public function upadateprof($data,$id)
    {

        $db = \Config\Database::connect();

        $builder = $db->table('users');

        $builder->where('email', $id);
        $builder->update($data);
---
UPDATE `users` SET `username` = 'AJITH TS', `password` = '$2y$10$votxGIvckOpT5gzUZbgNn.MqLDgL9OHrpKqdzeSWINCr67qFGl2.S'
WHERE `email` = 'ksajaykumar73@gmail.com'