app/Models/feeDetailsModel.php

    public function feeAdd($data)
    {
        //insert fee details into the fee amount table
        // echo '<pre>';
        // print_r($data);
        $db = \Config\Database::connect();
        $builder = $db->table('fee_settings');
        $res = $builder->insert($data);
---
INSERT INTO `fee_settings` (`yearOfAdmission`, `fee_head`, `programme`, `accadamicYear`, `collectionType`, `collectionRemark`, `totalAmount`, `applicableFrom`, `applicableTill`, `exemption`) VALUES ('2019', 'Computer Lab', 'B.Com-2', '19-20', 'monthly', ',jun:10,jul:10,aug:10,sep:10,oct:10,nov:10,dec:10,jan:10,feb:10,mar:10', '100', ',jun:2023-06-01,jul:2023-07-01,aug:2023-08-01,sep:2023-09-01,oct:2023-10-01,nov:2023-11-01,dec:2023-12-01,jan:2024-01-01,feb:2024-02-01,mar:2024-03-01', ',jun:2024-01-04,jul:2023-07-01,aug:2023-08-01,sep:2023-09-01,oct:2023-10-01,nov:2023-11-01,dec:2023-12-01,jan:2024-01-01,feb:2024-02-01,mar:2024-03-01', ',:=::0:0,')

    public function studentFeeRegistration($data)
    {
        //function to register student fee in the std_fee_reg form
        print_r($data);
        $con = \Config\Database::connect();
        $builder = $con->table('std_fee_reg');
        $result = $builder->insertBatch($data);
---
INSERT INTO `std_fee_reg` (`Amount`, `admissionNo`, `collectionRemark`, `dueDate`, `feeAllocationYear`, `fee_head`)
VALUES ('20','2003','jun','2023-06-30','23-24','Computer Lab'), ('20','2003','jul','2023-07-31','23-24','Computer Lab'), ('20','2003','aug','2023-08-31','23-24','Computer Lab'), ('20','2003','sep','2023-09-30','23-24','Computer Lab'), ('20','2003','oct','2023-10-31','23-24','Computer Lab'), ('20','2003','nov','2023-11-30','23-24','Computer Lab'), ('20','2003','dec','2023-12-31','23-24','Computer Lab'), ('20','2003','jan','2024-01-31','23-24','Computer Lab'), ('20','2003','feb','2024-02-29','23-24','Computer Lab'), ('20','2003','mar','2024-03-31','23-24','Computer Lab'), ('1000','2003','Yearly','2024-03-31','23-24','Tution Fee 1')