app/Models/stdview_model.php

         public function stdmodel2()
         {
             $db = \Config\Database::connect();
             $builder = $db->table('student');

         $builder->select('*');
         $builder->where('approval', 'approved');
         $result = $builder->get();
---
SELECT *
FROM `student`
WHERE `approval` = 'approved'