app/Models/usrreg_model.php

SELECT `username`, `password`, `designation`, `email`
FROM `users`
WHERE `email` = 'r@gmail.com'
---
  public function verifyEmail($email)
  {
    $builder = $this->db->table('users');
    $builder->select("username,password,designation,email");
    $builder->where('email',$email);
    $result = $builder->get();